/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
关于产品阶段环境参数，可能的值的解释：
    @development : 开发环境，对应静态资源域名为：dev.01.wkzf - dev.10.wkzf
    @test：测试环境，对应静态资源域名为：test.01.wkzf - test.10.wkzf
    @beta：beta环境，对应静态资源域名为：beta01.wkzf.com - beta10.wkzf.com
    @production ：生产环境，对应静态资源域名为：cdn01.wkzf.com - cdn10.wkzf.com
 -----------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
var STAGE_ENVIRONENT = "dev";
